###############################################################################
# Created by write_sdc
###############################################################################
current_design pll_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sys_clk -period 24.0000 [get_ports {sys_clk}]
set_clock_transition 0.1500 [get_clocks {sys_clk}]
set_clock_uncertainty 0.2500 sys_clk
set_propagated_clock [get_clocks {sys_clk}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[0]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[10]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[11]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[12]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[13]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[14]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[15]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[16]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[17]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[18]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[19]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[1]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[20]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[21]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[22]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[23]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[24]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[25]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[26]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[27]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[28]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[29]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[2]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[30]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[31]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[3]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[4]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[5]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[6]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[7]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[8]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {div_val[9]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[0]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[10]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[11]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[12]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[13]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[14]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[15]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[16]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[17]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[18]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[19]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[1]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[20]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[21]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[22]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[23]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[24]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[25]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[26]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[27]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[28]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[29]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[2]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[30]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[31]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[3]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[4]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[5]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[6]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[7]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[8]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {initial_freq[9]}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {ref_clk}]
set_input_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {rst_n}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[0]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[10]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[11]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[12]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[13]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[14]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[15]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[16]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[17]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[18]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[19]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[1]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[20]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[21]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[22]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[23]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[24]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[25]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[26]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[27]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[28]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[29]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[2]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[30]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[31]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[3]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[4]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[5]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[6]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[7]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[8]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {debug_dco_word[9]}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {lock_detect}]
set_output_delay 4.8000 -clock [get_clocks {sys_clk}] -add_delay [get_ports {pll_out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {lock_detect}]
set_load -pin_load 0.0729 [get_ports {pll_out}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[31]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[30]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[29]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[28]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[27]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[26]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[25]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[24]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[23]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[22]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[21]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[20]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[19]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[18]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[17]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[16]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[15]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[14]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[13]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[12]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[11]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[10]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[9]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[8]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[7]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[6]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[5]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[4]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[3]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[2]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[1]}]
set_load -pin_load 0.0729 [get_ports {debug_dco_word[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sys_clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div_val[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {initial_freq[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 4.0000 [current_design]
